Catalogs/тсШаблоныПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>тсШаблоныПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНаПримереДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКШаблонуWord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоТега</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецТега</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ИмяФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикрепляемогоФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегРегНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегРегДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИсходящуюКорреспонденцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлДок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыИСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляПолученияЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДопСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДопСвойства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПолейУЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПустоеЗначениеНеПробел</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыбораТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьИтоги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДополнительногоОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязьСоСтрокойПоПолю</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимДополнительногоОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКолонок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Comment>Заголовок </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияВидимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЭлДок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЭлДок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Word</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OpenOffice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Универсальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПолейУЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПолейУЭД</Name>
			<Comment>Хранит тип реквизитов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/тсШаблоныПечатныхДокументов/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура _ЗаписатьХранилищеЗначений(НомерСтроки, Хранилище) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.РеквизитыИСвойства Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.Хранилище = Хранилище;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры

Процедура Записать_СтрокаХранилище(НомерСтроки, МассивДанных) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.РеквизитыИСвойства Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.СтрокаХранилище = "";
			Для Каждого СтрМ Из МассивДанных Цикл
				Стр.СтрокаХранилище = Стр.СтрокаХранилище + "[" + СтрМ + "]";
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры

Процедура _ЗаписатьХранилищеЗначенийТаблицаТаблиц(ИндексСтроки, Хранилище, UID) Экспорт
	Записать();
	Структура = Новый Структура;
	Структура.Вставить("UID", UID);
	Стр = ЭтотОбъект.ТаблицаТаблиц.НайтиСтроки(Структура);
	Стр[ИндексСтроки].Хранилище = Хранилище;
	Записать();
КонецПроцедуры

Процедура _ЗаполнитьХранилищеТаблицаВыбораТаблиц(НомерСтроки, Хранилище) Экспорт
	Записать();
	Для Каждого Стр Из ЭтотОбъект.ТаблицаВыбораТаблиц Цикл
		Если Стр.НомерСтроки = НомерСтроки Тогда
			Стр.Хранилище = Хранилище;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Записать();
КонецПроцедуры

Процедура ЗагрузитьМакет(АдресВХ) Экспорт

	ЗагрузитьМакетБезСохранения(АдресВХ);
	Записать();

КонецПроцедуры

Функция МакетШаблона() Экспорт

	Возврат ХранилищеШаблона.Получить();
	
КонецФункции

#Область ИнтерфейсИнициализация

Функция ЭтоКонвертация() Экспорт

	ДополнительныеСвойства.Вставить("Конвертация", Истина);
	
	Возврат ЭтотОбъект;

КонецФункции // ()

Функция УстановитьМакет(Значение) Экспорт

	ДополнительныеСвойства.Вставить("Макет", Значение);
	
	Возврат ЭтотОбъект;

КонецФункции // ()

Функция ТипШаблона(Значение) Экспорт

	Если ТипЗнч(Значение) <> Тип("ПеречислениеСсылка.ТипыЭлДок") Тогда
	
		ВызватьИсключение "Необходимо передать ПеречислениеСсылка.ТипыЭлДок";
	
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТипШаблона", Значение);
	
	Возврат ЭтотОбъект;

КонецФункции // ()

Функция ТегЛево(Значение = "") Экспорт

	Тег = ЗначенияНовогоТега();
	Тег.Вставить("Начало", Значение);
	
	Возврат ЭтотОбъект;

КонецФункции // ()

Функция ТегПраво(Значение = "") Экспорт

	Тег = ЗначенияНовогоТега();
	Тег.Вставить("Конец", Значение);
	
	Возврат ЭтотОбъект;

КонецФункции // ()

Функция Собрать() Экспорт

	УстановитьНовыйТег();
	УстановитьНовыйМакет();
	УстановитьТипШаблона();
	КорректировкаНастроенныхТегов();
	ЗаполнитьСведенияОбластей();
	
	Возврат ЭтотОбъект;

КонецФункции // ()

#КонецОбласти

#Область ИнтерфейсОбработкаМакетаСКД

Функция ПараметрыОбластейШаблонаСКД() Экспорт

	Макет = ИнициализироватьМакет();
	ПараметрыОбластей = Новый Структура;
	Для каждого Область Из Макет.СтруктураДокумента.ОбластиДокумента Цикл
	
		ТегиОбласти = Справочники.тсШаблоныПечатныхДокументов.ПолучитьПараметрыОбласти(
			Макет,
			Область
		);
		ПараметрыОбластей.Вставить(
			Область.Ключ,
			ТегиОбласти
		);
	
	КонецЦикла;
	
	Возврат ПараметрыОбластей;

КонецФункции // ()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
	
		ЭтотОбъект.ТипДокумента = Константы.ТипШаблонаДляПечати.Получить();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ТипДокумента = Перечисления.ТипыЭлДок.Универсальный
		И ВТегахЕстьТочки() Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В Универсальных шаблонах у Тегов не должно быть ""."" (Точек)";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеОбработкаМакетаСКД

Функция ИнициализироватьМакет()

	БинДанные = МакетШаблона();
	Возврат УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(
		БинДанные,
		""
	);

КонецФункции // ()

#КонецОбласти

Функция ЗначенияНовогоТега()

	Тег = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("Тег", Тег) Тогда
	
		Тег = Новый Структура;
		Тег.Вставить("Начало", "");
		Тег.Вставить("Конец", "");
	
	КонецЕсли;
	
	Возврат Тег;

КонецФункции // ()

Процедура УстановитьНовыйТег()

	Тег = ЗначенияНовогоТега();
	
	СтарыйТег = Новый Структура;
	СтарыйТег.Вставить("Начало", НачалоТега);
	СтарыйТег.Вставить("Конец", КонецТега);
	
	НачалоТега = Тег["Начало"];
	КонецТега = Тег["Конец"];
	
	ТегРегНомер = ЗаменитьСимволТега(ТегРегНомер, СтарыйТег, Тег);
	ТегРегДата = ЗаменитьСимволТега(ТегРегДата, СтарыйТег, Тег);
	
	Для каждого Настройка Из РеквизитыИСвойства Цикл
	
		Настройка.Поле = ЗаменитьСимволТега(
			Настройка.Поле,
			СтарыйТег,
			Тег
		);
	
	КонецЦикла;

КонецПроцедуры

Функция ЗаменитьСимволТега(Знач Текст, СтарыйТег, Тег)

	ЭтоКонвертация = Неопределено;
	Если ДополнительныеСвойства.Свойство("Конвертация", ЭтоКонвертация)
		И ЭтоКонвертация Тогда
	
		Текст = СтрЗаменить(Текст, " ", "");
	
	КонецЕсли;
	
	ЗашитыеДанные = УправлениеПечатьюУЗВспомогательныйКлиентСервер;
	Возврат ЗашитыеДанные.ЗаменитьСимволТега(Текст, СтарыйТег, Тег);

КонецФункции // ()

Процедура УстановитьНовыйМакет()

	Макет = Неопределено;
	Если ДополнительныеСвойства.Свойство("Макет", Макет) Тогда
	
		ЗагрузитьМакетБезСохранения(Макет);
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьМакетБезСохранения(Макет)

	БинДанные = ПолучитьИзВременногоХранилища(Макет);
	ХранилищеШаблона = Новый ХранилищеЗначения(БинДанные);

КонецПроцедуры

Процедура УстановитьТипШаблона()

	Если Не ЗначениеЗаполнено(ТипДокумента) Тогда
	
		ТипДокумента = Константы.ТипШаблонаДляПечати.Получить();
	
	КонецЕсли;
	
	ТипШаблона = Неопределено;
	Если ДополнительныеСвойства.Свойство("ТипШаблона", ТипШаблона) Тогда
	
		ТипДокумента = ТипШаблона;
	
	КонецЕсли;

КонецПроцедуры

Функция ТипШаблонаУстановленВручную()

	Возврат ДополнительныеСвойства.Свойство("ТипШаблона")
		ИЛИ ЗначениеЗаполнено(ТипДокумента);

КонецФункции // ()

Процедура ЗаполнитьСведенияОбластей()

	ОбластиШаблона.Очистить();
	Если ТипДокумента <> Перечисления.ТипыЭлДок.Универсальный Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ПараметрыОбластей = ПараметрыОбластейШаблонаСКД();

	Для каждого ПараметрыОбласти Из ПараметрыОбластей Цикл
	
		НоваяОбласть = ОбластиШаблона.Добавить();
		НоваяОбласть.ИмяОбласти = ПараметрыОбласти.Ключ;
		НоваяОбласть.ТипОбласти = "Общая";

		ПараметрыТекущейОбласти = ПараметрыОбласти.Значение;
		Для каждого ПараметрОбласти Из ПараметрыТекущейОбласти Цикл
		
			ТекущийПараметр = РеквизитыИСвойства.Найти(ПараметрОбласти, "Поле");
			
			Если ТекущийПараметр = Неопределено Тогда
			
				ТекущийПараметр = РеквизитыИСвойства.Добавить();
				ТекущийПараметр.Используется = Истина;
				ТекущийПараметр.Поле = ПараметрОбласти;
				ТекущийПараметр.ТипПоля = Перечисления.ТипыПолейУЭД.Реквизит;
			
			КонецЕсли;
			
			ТекущийПараметр.ИмяОбласти = НоваяОбласть.ИмяОбласти;
		
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

Процедура КорректировкаНастроенныхТегов()

	Если ТипДокумента <> Перечисления.ТипыЭлДок.Универсальный Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Для каждого Настройка Из РеквизитыИСвойства Цикл
	
		Настройка.Поле = СтрЗаменить(Настройка.Поле, " ", "");
	
	КонецЦикла;

КонецПроцедуры

Функция ВТегахЕстьТочки()

	Поля = РеквизитыИСвойства.ВыгрузитьКолонку("Поле");
	Для каждого Поле Из Поля Цикл
	
		Если СтрНайти(Поле, ".") <> 0 Тогда
		
			Возврат Истина;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ()


#КонецОбласти
